app/controllers/shelters/pets_controller.rb

  def index
    @shelter = Shelter.find(params[:shelter_id])
    @pets = @shelter.pets.all
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "pets".* FROM "pets" WHERE "pets"."shelter_id" = $1  [["shelter_id", 0]]

  def edit
    pet = Pet.find(params[:id])
    shelter = Shelter.find(pet.shelter_id)
    # binding.pry
    if pet_params.values.any?('') == false
      shelter.pets.create(pet_params)
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "pets" ("shelter_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["shelter_id", 2], ["created_at", "2020-08-27 17:37:25.993411"], ["updated_at", "2020-08-27 17:37:25.993411"]]

  def create
    binding.pry
    shelter = Shelter.find(params[:id])
    if pet_params.values.any?('') == false
      shelter.pets.create(pet_params)
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "pets" ("image", "name", "approximate_age", "sex", "shelter_id", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    Pet.destroy(params[:id])
---
DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 2]]