app/controllers/shelters/reviews_controller.rb

  def index
    @reviews = Review.where(shelter_id: params[:id])
    @shelter = Shelter.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."shelter_id" = $1  [["shelter_id", 1]]
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    shelter = Shelter.find(params[:id])
    if review_params.values.any?('') == false
      shelter.reviews.create(review_params)
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "reviews" ("title", "rating", "content", "image", "shelter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "qf"], ["rating", "weg"], ["content", "weg"], ["image", "gew"], ["shelter_id", 1], ["created_at", "2020-08-27 02:09:08.815356"], ["updated_at", "2020-08-27 02:09:08.815356"]]

  def destroy
    Review.destroy(params[:id])
---
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 7]]