app/views/favorites/index.html.erb

SELECT "pets".* FROM "pets"
---

<% @favorites.favorite_pets.each do |favorite_pet| %>