app/views/adoption_apps/new.html.erb

<% else %>
    <% @favorites.favorite_pets.each do |favorite_pet| %>
---
SELECT "pets".* FROM "pets"