app/controllers/adoption_apps_controller.rb

SELECT "pets".* FROM "pets"
---
  def new
    @pets = Pet.all