app/controllers/favorites_controller.rb

SELECT "pets".* FROM "pets"
---
  def index
    @favorite_pets = session[:favorites]
    @pets = Pet.all

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def update
    pet = Pet.find(params[:id])
    if favorites.favorite_pets.include?(pet.id.to_s)

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def remove
    pet = Pet.find(params[:id])