app/controllers/pets_controller.rb

DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 1]]
---
  def destroy
    Pet.destroy(params[:id])