app/controllers/pets_controller.rb

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @pet = Pet.find(params[:id])

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "pets" SET "image" = $1, "name" = $2, "sex" = $3, "updated_at" = $4 WHERE "pets"."id" = $5  [["image", ""], ["name", "eatn"], ["sex", ""], ["updated_at", "2020-08-27 02:11:52.922853"], ["id", 5]]
---
  def update
    @pet = Pet.find(params[:id])
    @pet.update(pet_params)