app/controllers/reviews_controller.rb

  def update
    review = Review.find(params[:id])
    review.update(review_params)
    if review.save
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "reviews" SET "title" = $1, "rating" = $2, "content" = $3, "updated_at" = $4 WHERE "reviews"."id" = $5  [["title", "aeh"], ["rating", "grea"], ["content", "gre"], ["updated_at", "2020-08-29 20:59:17.192609"], ["id", 5]]
UPDATE "reviews" SET "title" = $1, "rating" = $2, "content" = $3, "image" = $4, "updated_at" = $5 WHERE "reviews"."id" = $6  [["title", "Title"], ["rating", "Rating"], ["content", "Content"], ["image", "Image"], ["updated_at", "2020-08-27 01:16:50.981365"], ["id", 2]]