app/controllers/reviews_controller.rb

DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]
---
  def destroy
    Review.destroy(params[:id])