app/controllers/shelters_controller.rb

SELECT "shelters".* FROM "shelters"
---
  def index
    @shelters = Shelter.all

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @shelter = Shelter.find(params[:id])

INSERT INTO "shelters" ("name", "address", "city", "state", "zip", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "alskdfj"], ["address", "alkjifeji"], ["city", "lka;dsf"], ["state", "lj"], ["zip", "laksf"], ["created_at", "2020-08-23 00:30:06.820134"], ["updated_at", "2020-08-23 00:30:06.820134"]]
---
  def create
    Shelter.create(shelter_params)

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @shelter = Shelter.find(params[:id])

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "shelters" SET "name" = $1, "address" = $2, "city" = $3, "state" = $4, "zip" = $5, "updated_at" = $6 WHERE "shelters"."id" = $7  [["name", "fdh"], ["address", ""], ["city", ""], ["state", ""], ["zip", ""], ["updated_at", "2020-08-27 01:06:45.848270"], ["id", 1]]
---
  def update
    @shelter = Shelter.find(params[:id])
    @shelter.update(shelter_params)

DELETE FROM "shelters" WHERE "shelters"."id" = $1  [["id", 259]]
---
  def destroy
    Shelter.destroy(params[:id])