app/views/shelters/pets/index.html.erb


<% @shelter.pets.each do |pet| %>
---
SELECT "pets".* FROM "pets" WHERE "pets"."shelter_id" = $1  [["shelter_id", 1]]